Current/Product/Production/Common/PropAccessorCA/test/TestForceRefresh/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:propertyaccess">
  <soapenv:Body>
    <urn:ForceRefreshRequest>
      <urn:propertyFile>testperiodic</urn:propertyFile>
    </urn:ForceRefreshRequest>
  </soapenv:Body>
</soapenv:Envelope>