Product/Production/Common/NhincCoreCA/test/TestGetPropertyFileLocation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:propertyaccess">
  <soapenv:Body>
    <urn:GetPropertyFileLocationRequest>
      <urn:noopPlaceHolder>noop</urn:noopPlaceHolder>
    </urn:GetPropertyFileLocationRequest>
  </soapenv:Body>
</soapenv:Envelope>